#题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成 3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？  
#1.程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

def get_bonus(l):
    if l <= 100000:
        bonus = l * 0.10
    elif l <= 200000:
        bonus = 100000 * 0.10 + (l - 100000) * 0.075
    elif l <= 400000:
        bonus = 100000 * 0.10 + 100000 * 0.075 + (l - 200000) * 0.05
    elif l <= 600000:
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000* 0.05 + (l - 400000) * 0.03
    elif l <= 1000000:
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (l - 600000) * 0.015
    else:
        bonus = 100000 * 0.10 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (l - 1000000) * 0.01
    return bonus

if __name__ == "__main__":
    l = int(input("请输入利润："))
    print(f"发放奖金总金额为：{get_bonus(l)}元")
